<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"test-exclude tofu_exclude_testing","plan_modifier":"0d62dcbd3bc2ea10ea9557dd29ee0eda9446c1120f2224fbf8ce1a670c982ec1","backend":"f19d3f236904076c02b03b137ee4ade9818ff94fa7ecf0cd7c868468da0d7a2b","plan_job_ref":"Job Test actions using target, replace, and exclude #9 at https://github.com/dflook/terraform-github-actions/actions/runs/16652016977","plan_out_hash":"2fe633a24ba20457fe17e03143d762e5a0aca2e596b154c64bb466af44588f04","plan_hash":"dc05aa054da76dab8441244742a0e67c1f0e9d0d18a888e2bf366b2f3989ecdb","plan_text_format":"diff","version":"99.0.0"} -->
OpenTofu plan for __test-exclude tofu_exclude_testing__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # random_string.count[0] will be created
+   resource "random_string" "count" {
+       id          = (known after apply)
+       length      = 5
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.foreach["hello"] will be created
+   resource "random_string" "foreach" {
+       id          = (known after apply)
+       length      = 5
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.keep_me will be created
+   resource "random_string" "keep_me" {
+       id          = (known after apply)
+       length      = 5
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   count   = (known after apply)
+   foreach = (known after apply)
+   keep_me = (known after apply)

Warning: Resource targeting is in effect

You are creating a plan with either the -target option or the -exclude
option, which means that the result of this plan may not represent all of the
changes requested by the current configuration.

The -target and -exclude options are not for routine use, and are provided
only for exceptional situations such as recovering from errors or mistakes,
or when OpenTofu specifically suggests to use it as part of an error message.
```
</details>

:memo: Plan generated in [Test actions using target, replace, and exclude #9](https://github.com/dflook/terraform-github-actions/actions/runs/16652016977)